# Psig Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Psig Property
SymbolTypeId Class See Also
---
Symbol psig, indicating unit Pounds force per square inch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Psig { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Psig As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Psig {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace